package days04;

/**
 * @author jam
 * @date 오전 9:07:38
 * @subject [jdbc] 
 * @content 
 */
public class Ex03 {
	public static void main(String[] args) {
		
		/*
		 * 게시글 상세보기
		 * 
		 * 일반적으로는 게시글의 목록을 출력한 이후에 원하고자 하는 게시글의 페이지에 들어가서 해당 게시글을 봐야하지만
		 * 버튼을 클릭하며 접속할 수 없기 때문에 원하고자 하는 게시글의 번호(seq)를 매개변수로 입력받아서
		 * 해당 게시글의 상세보기를 출력한다
		 * 게시글에는 작성자,제목,내용,작성일자,이메일 등의 정보를 가져와서 출력한다.
		 * 출력하는 서비스가 실행되며 해당 서비스에는 출력하는 쿼리가 코딩되어 있다.
		 * 출력하는 select문에서 매개변수로 받아왔던 값을 where = ? 조건문으로 원하는 게시글의 정보만 출력한다.
		 * 출력하고자하는 컬럼은 DAO (DTO에서 선언된 변수를 활용한 메서드) 에서 설정한다.
		 * 
		 * */
		
		
	}
}
